app/controllers/api/v1/pictures_controller.rb

      def show
        @picture = Picture.find_by_uuid(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."uuid" = $1 LIMIT $2  [["uuid", "2a2a2832-1f68-4cbc-9222-8af6c3043c2b"], ["LIMIT", 1]]

      def create
        @picture = current_api_user.sent_pictures.new
        @tagged = User.find_by_username(params[:user_id])
        uuid = SecureRandom.uuid

        if !@tagged
          render json: {error: "Username not found"}, status: :bad_request
          return
        end

        image = Paperclip.io_adapters.for(params[:image])
        image.original_filename = "#{uuid}.jpg"

        @picture.uuid = uuid
        @picture.image = image
        @picture.tagged = @tagged
        @picture.caption = params[:caption]

        if @picture.save
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "lurodrigo"], ["LIMIT", 1]]
INSERT INTO "pictures" ("taken_by_id", "tagged_id", "created_at", "updated_at", "caption", "uuid", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

      def sent
        if params[:user_id] == 'self'
          @user = current_api_user
        else
          @user = User.find_by_username(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jmorais"], ["LIMIT", 1]]

      def received
        if params[:user_id] == 'self'
          @user = current_api_user
        else
          @user = User.find_by_username(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "lurodrigo"], ["LIMIT", 1]]

      def comment
        @picture = Picture.find_by_uuid(params[:id])
        @comment = @picture.comments.create

        @comment.user = current_api_user
        @comment.comment = params[:comment]

        if @comment.save
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."uuid" = $1 LIMIT $2  [["uuid", "2a2a2832-1f68-4cbc-9222-8af6c3043c2b"], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "commentable_type", "commentable_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "tokens" = $1, "updated_at" = $2 WHERE "users"."id" = $3

      def comments
        @picture = Picture.find_by_uuid(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."uuid" = $1 LIMIT $2  [["uuid", "2a2a2832-1f68-4cbc-9222-8af6c3043c2b"], ["LIMIT", 1]]