app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "followers"], ["LIMIT", 1]]
---
      def show

        if params[:id] == 'self'
          @user = current_api_user
        else
          @user = User.find_by_username(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "lurodrigo"], ["LIMIT", 1]]
---
      def relationship
        @user = User.find_by_username(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "lurodrigo"], ["LIMIT", 1]]
---
      def follow
        @user = User.find_by_username(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "lurodrigo"], ["LIMIT", 1]]
---
      def unfollow
        @user = User.find_by_username(params[:id])